andypiper/Lite3DP-Gen-2/Firmware/LITE3DP-G2-IDF/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32"

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Flash size: 4 MB
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Arduino component: enable for library compatibility
CONFIG_ENABLE_ARDUINO_DEPENDS=y
CONFIG_AUTOSTART_ARDUINO=n

# FreeRTOS: tick rate and stack sizes
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# Task watchdog: only monitor Core 0 idle task.
# Core 1 runs the motor task which can busy-loop during homing.
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n

# SPI flash
CONFIG_SPI_FLASH_SUPPORT_ISSI_CHIP=y
CONFIG_SPI_FLASH_SUPPORT_MXIC_CHIP=y
CONFIG_SPI_FLASH_SUPPORT_GD_CHIP=y
CONFIG_SPI_FLASH_SUPPORT_WINBOND_CHIP=y

# Log level: INFO in production
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# NVS for preferences
CONFIG_NVS_ASSERT_ERROR_CHECK=n

# Stack sizes
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
